<!doctype html>
<html lang="ja">
<head>
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=0.46, maximum-scale=1.0, user-scalable=yes">
<meta name="description" content="自分で撮影した野鳥の図鑑。Google画像検索、YouTube野鳥検索付き。">
<meta property="og:title" content="My 野鳥図鑑">
<meta property="og:description" content="自分で撮影した野鳥の図鑑。Google画像検索、YouTube野鳥検索付き。">
<meta property="og:image" content="//ok2nd.sakura.ne.jp/birds/photo/320/kogera.jpg">
<title>My 野鳥図鑑</title>
<link href="https://fonts.googleapis.com/css?family=Sawarabi+Mincho" rel="stylesheet">
<link href="css/thumbnail-v2.css?20201102" rel="stylesheet">
<style>
body {
	color: #666;
	font-family: 'Sawarabi Mincho', Helvetica, Arial, sans-serif;
	margin: 20px 0 60px 20px;
}
@media screen {
	body {
		background: #f8f8f4;
	}
}
@media print {
	body {
		background: #fff;
	}
}
#contents {
	margin: 0 auto;
	display: flex;
	justify-content: center;
	align-items: center;
}
#gallery {
	/*	↓ これがあると、page-break-after が効かない
		display: flex;
		flex-wrap: wrap;
	*/
	align-items: center;
/*	width: 1116px; 横幅 写真3つまで */
	margin: auto;
}
h1 {
	font-weight: normal;
	text-align: center;
	font-size: 24px;
	margin: 0 0 4px 0;
	padding: 0;
}
p {
	text-align: center;
}
#goukei {
	font-size: 20px;
	font-weight: bold;
}
.description {
	font-size: 14px;
}
.break {
	page-break-after: always;
}
@media print {
	.title {display: none;}
	.description {display: none;}
	.search1 {display: none;}
	.search2 {display: none;}
	#footer {display: none;}
}
@media screen {
	.page-top {display: none;}
}
.page-top {
	color: #f8f8f4;
	font-size: 16px;
}
/* 画像をポップアップ */
#modal-container {
	display: none;
	position: fixed;
	background: rgba(0, 0, 0, 0.6);
	top: 0;
	bottom: 0;
	left: 0;
	right: 0;
	z-index: 99;
}
#modal-container > div {
	display: flex;
	height: 100vh;
	justify-content: center;
	align-items: center;
}
#modal-container > div > img {
	max-width: calc(100vw - 60px);
	max-height: calc(100vh - 60px);
	padding: 10px;
	background-color: #fff;
	box-shadow: 0 3px 18px -4px rgba(0, 0, 0, 0.8);
	border-radius: 10px;
}
img.popup {
	cursor: pointer;
}
</style>
<script src="https://code.jquery.com/jquery-3.6.0.min.js" integrity="sha256-/xUj+3OJU5yExlq6GSYGSHk7tPXikynS7ogEvDej/m4=" crossorigin="anonymous"></script>
</head>
<body>
<h1 class="title">My 野鳥図鑑　（<a href="mizudori.php">→ 水鳥・猛禽類</a>）</h1>
<p class="description">「Zoo」：ZooPicker。「画像」：Google画像検索。「動画」：YouTube野鳥。「Blog」：撮影時ブログ記事。<span style="color:Orangered">印刷は53%、余白なしで。</span></p>
<p class="page-top">.....</p>
<div id="contents">
	<div id="gallery">
<?php
$birds[] = array(
	'名前' =>	'ルリビタキ',	'オスメス' => 'オス',
	'場所' =>	'武田尾',
	'年月' =>	'2020.2',
	'Zoo番号' =>	'8476',
	'ブログ' =>	'2020/02/01/214532',
	'写真' =>	'ruribitaki-m'
);
/*
$birds[] = array(
	'名前' =>	'ルリビタキ',	'オスメス' => 'オス',
	'場所' =>	'有馬富士公園',
	'年月' =>	'2020.1',
	'Zoo番号' =>	'8476',
	'ブログ' =>	'2020/01/19/223645',
	'写真' =>	'rurubitaki'
);
*/
$birds[] = array(
	'名前' =>	'ルリビタキ',	'オスメス' => 'メス',
	'場所' =>	'有馬富士公園',
	'年月' =>	'2020.12',
	'Zoo番号' =>	'8476',
	'ブログ' =>	'2020/12/18/120259',
	'写真' =>	'ruribitaki-f2'
);
$birds[] = array(
	'名前' =>	'ジョウビタキ',	'オスメス' => 'オス',
	'場所' =>	'淡路島公園',
	'年月' =>	'2020.2',
	'Zoo番号' =>	'9483',
	'ブログ' =>	'2020/02/02/232110',
	'写真' =>	'joubitaki-m'
);
$birds[] = array(
	'名前' =>	'ジョウビタキ',	'オスメス' => 'メス',
	'場所' =>	'甲山森林公園',
	'年月' =>	'2020.1',
	'Zoo番号' =>	'9483',
	'ブログ' =>	'2020/01/18/192119',
	'写真' =>	'joubitaki'
);
$birds[] = array(
	'名前' =>	'キビタキ',	'オスメス' => 'オス',
	'場所' =>	'神戸森林植物園',
	'年月' =>	'2020.5',
	'Zoo番号' =>	'7090',
	'ブログ' =>	'2020/05/21/231511',
	'写真' =>	'kibitaki'
);
/*
$birds[] = array(
	'名前' =>	'ウグイス',	'オスメス' => '',
	'場所' =>	'神戸森林植物園',
	'年月' =>	'2020.5',
	'Zoo番号' =>	'9439',
	'ブログ' =>	'2020/05/21/231511',
	'写真' =>	'uguisu2'
);
*/
$birds[] = array(
	'名前' =>	'ウグイス',	'オスメス' => '',
	'場所' =>	'黒川・桜の森',
	'年月' =>	'2021.3',
	'Zoo番号' =>	'9439',
	'ブログ' =>	'2021/03/29/225552',
	'写真' =>	'uguisu2'
);
$birds[] = array(
	'名前' =>	'ホオジロ',	'オスメス' => 'オス',
	'場所' =>	'淡路島公園',
	'年月' =>	'2020.2',
	'Zoo番号' =>	'8762',
	'ブログ' =>	'2020/02/02/232110',
	'写真' =>	'hoojiro-m'
);
$birds[] = array(
	'名前' =>	'ホオジロ',	'オスメス' => 'メス',
	'場所' =>	'有馬富士公園',
	'年月' =>	'2020.1',
	'Zoo番号' =>	'8762',
	'ブログ' =>	'2020/01/19/223645',
	'写真' =>	'hoojiro'
);
$birds[] = array(
	'名前' =>	'ホオアカ',	'オスメス' => '',
	'場所' =>	'大分県くじゅうタデ原湿原',
	'年月' =>	'2019.5',
	'Zoo番号' =>	'4632',
	'ブログ' =>	'2019/05/25/205928',
	'写真' =>	'hooaka'
);
$birds[] = array(
	'名前' =>	'シロハラ',	'オスメス' => '',
	'場所' =>	'神戸森林植物園',
	'年月' =>	'2020.1',
	'Zoo番号' =>	'7560',
	'ブログ' =>	'2020/01/21/174347',
	'写真' =>	'shirohara'
);
/*
$birds[] = array(
	'名前' =>	'ツグミ',	'オスメス' => '',
	'場所' =>	'淡路島公園',
	'年月' =>	'2020.2',
	'Zoo番号' =>	'6586',
	'ブログ' =>	'2020/02/02/232110',
	'写真' =>	'tsugumi2'
);
$birds[] = array(
	'名前' =>	'ツグミ',	'オスメス' => '',
	'場所' =>	'神戸しあわせの村',
	'年月' =>	'2020.1',
	'Zoo番号' =>	'6586',
	'ブログ' =>	'2020/01/30/220058',
	'写真' =>	'tsugumi'
);
*/
$birds[] = array(
	'名前' =>	'クロツグミ',	'オスメス' => 'オス',
	'場所' =>	'支笏湖野鳥の森',
	'年月' =>	'2018.5',
	'Zoo番号' =>	'8849',
	'ブログ' =>	'2018/05/11/140859',
	'写真' =>	'kurotsugumi'
);
$birds[] = array(
	'名前' =>	'クロツグミ',	'オスメス' => 'メス',
	'場所' =>	'大阪城公園',
	'年月' =>	'2022.11',
	'Zoo番号' =>	'8849',
	'ブログ' =>	'2022/11/04/153520',
	'写真' =>	'kurotsugumi-f'
);
$birds[] = array(
	'名前' =>	'ムクドリ',	'オスメス' => '',
	'場所' =>	'明石）石ケ谷公園',
	'年月' =>	'2021.3',
	'Zoo番号' =>	'8335',
	'ブログ' =>	'2021/03/03/234217',
	'写真' =>	'mukudori3'
);
$birds[] = array(
	'名前' =>	'ヤマガラ',	'オスメス' => '',
	'場所' =>	'雌岡山',
	'年月' =>	'2022.3',
	'Zoo番号' =>	'6793',
	'ブログ' =>	'2022/03/17/171124',
	'写真' =>	'yamagara3'
);
$birds[] = array(
	'名前' =>	'ハシブトガラ',	'オスメス' => '',
	'別名' =>	'コガラ',
	'場所' =>	'支笏湖野鳥の森',
	'年月' =>	'2018.5',
	'Zoo番号' =>	'758',
	'ブログ' =>	'2018/05/11/140859',
	'写真' =>	'hashibutigara'
);
$birds[] = array(
	'名前' =>	'ヒガラ',	'オスメス' => '',
	'場所' =>	'六甲山上',
	'年月' =>	'2020.3',
	'Zoo番号' =>	'6680',
	'ブログ' =>	'2020/03/24/222618',
	'写真' =>	'higara'
);
$birds[] = array(
	'名前' =>	'シジュウカラ',	'オスメス' => '',
	'場所' =>	'長居植物園',
	'年月' =>	'2020.1',
	'Zoo番号' =>	'8361',
	'ブログ' =>	'2020/01/15/153848',
	'写真' =>	'shijukara'
);
$birds[] = array(
	'名前' =>	'ゴジュウカラ',	'オスメス' => '',
	'場所' =>	'支笏湖野鳥の森',
	'年月' =>	'2018.5',
	'Zoo番号' =>	'9154',
	'ブログ' =>	'2018/05/11/140859',
	'写真' =>	'gojukara'
);
/*
$birds[] = array(
	'名前' =>	'モズ',	'オスメス' => '',
	'場所' =>	'長居植物園',
	'年月' =>	'2020.1',
	'Zoo番号' =>	'8818',
	'ブログ' =>	'2020/01/15/153848',
	'写真' =>	'mozu'
);
*/
$birds[] = array(
	'名前' =>	'ノビタキ',	'オスメス' => '',
	'場所' =>	'加古川両荘地区',
	'年月' =>	'2022.10',
	'Zoo番号' =>	'9443',
	'ブログ' =>	'2022/10/08/215401',
	'写真' =>	'nobitaki3'
);
$birds[] = array(
	'名前' =>	'カワラヒワ',	'オスメス' => '',
	'場所' =>	'播磨中央公園',
	'年月' =>	'2021.2',
	'Zoo番号' =>	'12854',
	'ブログ' =>	'2021/02/22/234247',
	'写真' =>	'kawarahiwa2'
);
$birds[] = array(
	'名前' =>	'アオジ',	'オスメス' => 'オス',
	'場所' =>	'京都府立植物園',
	'年月' =>	'2020.2',
	'Zoo番号' =>	'4704',
	'ブログ' =>	'2020/02/11/224407',
	'写真' =>	'aoji2'
);
$birds[] = array(
	'名前' =>	'アオジ',	'オスメス' => 'メス',
	'場所' =>	'日岡山公園',
	'年月' =>	'2022.4',
	'Zoo番号' =>	'4704',
	'ブログ' =>	'2022/04/20/220852',
	'写真' =>	'aoji-f'
);
$birds[] = array(
	'名前' =>	'ウソ',	'オスメス' => 'メス',
	'場所' =>	'淡路島公園',
	'年月' =>	'2020.2',
	'Zoo番号' =>	'9844',
	'ブログ' =>	'2020/02/02/232110',
	'写真' =>	'uso'
);
$birds[] = array(
	'名前' =>	'エナガ',	'オスメス' => '',
	'場所' =>	'播磨中央公園',
	'年月' =>	'2021.2',
	'Zoo番号' =>	'9342',
	'ブログ' =>	'2021/02/22/234247',
	'写真' =>	'enaga2'
);
/*
$birds[] = array(
	'名前' =>	'ハクセキレイ',	'オスメス' => '',
	'場所' =>	'武田尾',
	'年月' =>	'2020.2',
	'Zoo番号' =>	'4718',
	'ブログ' =>	'2020/02/01/214532',
	'写真' =>	'hakusekirei'
);
*/
$birds[] = array(
	'名前' =>	'キセキレイ',	'オスメス' => '',
	'場所' =>	'あいな里山公園',
	'年月' =>	'2021.4',
	'Zoo番号' =>	'607',
	'ブログ' =>	'2021/04/27/222623',
	'写真' =>	'kisekirei2'
);
$birds[] = array(
	'名前' =>	'シメ',	'オスメス' => '',
	'場所' =>	'淡路島公園',
	'年月' =>	'2020.2',
	'Zoo番号' =>	'7562',
	'ブログ' =>	'2020/02/02/232110',
	'写真' =>	'shime'
);
$birds[] = array(
	'名前' =>	'カケス',	'オスメス' => '',
	'場所' =>	'六甲山上',
	'年月' =>	'2020.3',
	'Zoo番号' =>	'8371',
	'ブログ' =>	'2020/03/24/222618',
	'写真' =>	'kakesu'
);
$birds[] = array(
	'名前' =>	'キレンジャク',	'オスメス' => '',
	'場所' =>	'服部緑地',
	'年月' =>	'2021.3',
	'Zoo番号' =>	'9153',
	'ブログ' =>	'2021/03/11/175140',
	'写真' =>	'kirenjyaku2'
);
$birds[] = array(
	'名前' =>	'メジロ',	'オスメス' => '',
	'場所' =>	'兵庫）黒川公民館近く',
	'年月' =>	'2020.2',
	'Zoo番号' =>	'9110',
	'ブログ' =>	'2020/02/23/211840',
	'写真' =>	'mejiro2'
);
$birds[] = array(
	'名前' =>	'ヒヨドリ',	'オスメス' => '',
	'場所' =>	'神戸森林植物園',
	'年月' =>	'2020.1',
	'Zoo番号' =>	'1444',
	'ブログ' =>	'2020/01/21/174347',
	'写真' =>	'hiyodori'
);
$birds[] = array(
	'名前' =>	'コゲラ',	'オスメス' => '',
	'場所' =>	'神戸しあわせの村',
	'年月' =>	'2020.1',
	'Zoo番号' =>	'9905',
	'ブログ' =>	'2020/01/30/220058',
	'写真' =>	'kogera'
);
$birds[] = array(
	'名前' =>	'アカゲラ',	'オスメス' => '',
	'場所' =>	'支笏湖野鳥の森',
	'年月' =>	'2018.5',
	'Zoo番号' =>	'6438',
	'ブログ' =>	'2018/05/11/140859',
	'写真' =>	'akagera'
);
/*
$birds[] = array(
	'名前' =>	'アカゲラ',	'オスメス' => '',
	'場所' =>	'札幌西岡公園',
	'年月' =>	'2019.6',
	'Zoo番号' =>	'6438',
	'ブログ' =>	'2019/06/07/123018',
	'写真' =>	'akagera2'
);
*/
$birds[] = array(
	'名前' =>	'カワセミ',	'オスメス' => '',
	'場所' =>	'烏原貯水池',
	'年月' =>	'2021.6',
	'Zoo番号' =>	'12913',
	'ブログ' =>	'2021/06/10/154732',
	'写真' =>	'kawasemi2'
);


$birds[] = array(
	'名前' =>	'サメビタキ',	'オスメス' => '',
	'場所' =>	'甲山森林公園',
	'年月' =>	'2022.10',
	'Zoo番号' =>	'7101',
	'ブログ' =>	'2022/10/12/175712',
	'写真' =>	'samebitaki2'
);
$birds[] = array(
	'名前' =>	'ソウシチョウ',	'オスメス' => '',
	'場所' =>	'有馬富士公園',
	'年月' =>	'2021.9',
	'Zoo番号' =>	'6095',
	'ブログ' =>	'2021/09/15/170838',
	'写真' =>	'soushicho3'
);
$birds[] = array(
	'名前' =>	'ホオジロハクセキレイ',	'オスメス' => '',
	'場所' =>	'三木山森林公園',
	'年月' =>	'2020.6',
	'Zoo番号' =>	'13402',
	'ブログ' =>	'2020/06/02/232042',
	'写真' =>	'hoojirohakusekirei'
);
$birds[] = array(
	'名前' =>	'アトリ',	'オスメス' => 'メス',
	'場所' =>	'神戸森林植物園',
	'年月' =>	'2020.12',
	'Zoo番号' =>	'8057',
	'ブログ' =>	'2020/12/10/224849',
	'写真' =>	'atori2'
);
$birds[] = array(
	'名前' =>	'セグロセキレイ',	'オスメス' => '',
	'場所' =>	'武庫川河川敷',
	'年月' =>	'2021.2',
	'Zoo番号' =>	'6577',
	'ブログ' =>	'2021/02/16/164133',
	'写真' =>	'segurosekirei2'
);
/*
$birds[] = array(
	'名前' =>	'モズ',	'オスメス' => 'オス',
	'場所' =>	'黒井城跡',
	'年月' =>	'2020.10',
	'Zoo番号' =>	'8818',
	'ブログ' =>	'2020/10/13/231107',
	'写真' =>	'mozu-osu'
);
*/
$birds[] = array(
	'名前' =>	'モズ',	'オスメス' => 'メス',
	'場所' =>	'黒井城跡',
	'年月' =>	'2020.10',
	'Zoo番号' =>	'8818',
	'ブログ' =>	'2020/10/13/231107',
	'写真' =>	'mozu-mesu'
);
$birds[] = array(
	'名前' =>	'キクイタダキ',	'オスメス' => '',
	'場所' =>	'六甲山',
	'年月' =>	'2020.12',
	'Zoo番号' =>	'5590',
	'ブログ' =>	'2020/12/23/224500',
	'写真' =>	'kikuitadaki'
);
$birds[] = array(
	'名前' =>	'トラツグミ',	'オスメス' => '',
	'場所' =>	'甲山森林公園',
	'年月' =>	'2022.1',
	'Zoo番号' =>	'6908',
	'ブログ' =>	'2022/01/22/170222',
	'写真' =>	'toratsugumi2'
);
$birds[] = array(
	'名前' =>	'マヒワ',	'オスメス' => '',
	'場所' =>	'妙見山',
	'年月' =>	'2020.12',
	'Zoo番号' =>	'7970',
	'ブログ' =>	'2020/12/05/204515',
	'写真' =>	'mahiwa'
);
$birds[] = array(
	'名前' =>	'カシラダカ',	'オスメス' => '',
	'場所' =>	'あいな里山公園',
	'年月' =>	'2020.12',
	'Zoo番号' =>	'5412',
	'ブログ' =>	'2020/12/07/201331',
	'写真' =>	'kashiradaka'
);
$birds[] = array(
	'名前' =>	'リュウキュウサンショウクイ',	'オスメス' => '',
	'場所' =>	'烏原貯水池',
	'年月' =>	'2021.3',
	'Zoo番号' =>	'13527',
	'ブログ' =>	'2021/01/25/173507',
	'写真' =>	'ryukyusanshoukui2'
);
$birds[] = array(
	'名前' =>	'カヤクグリ',	'オスメス' => '',
	'場所' =>	'六甲山',
	'年月' =>	'2022.112',
	'Zoo番号' =>	'5944',
	'ブログ' =>	'2022/11/19/192556',
	'写真' =>	'kayakuguri2'
);
$birds[] = array(
	'名前' =>	'イソヒヨドリ',	'オスメス' => 'オス',
	'場所' =>	'あいな里山公園',
	'年月' =>	'2020.5',
	'Zoo番号' =>	'4635',
	'ブログ' =>	'2020/05/30/181146',
	'写真' =>	'isohiyodori'
);
$birds[] = array(
	'名前' =>	'イソヒヨドリ',	'オスメス' => 'メス',
	'場所' =>	'鹿島・扇平自然公園',
	'年月' =>	'2021.4',
	'Zoo番号' =>	'4635',
	'ブログ' =>	'2021/04/07/222414',
	'写真' =>	'isohiyodori-f2'
);
$birds[] = array(
	'名前' =>	'モズ',	'オスメス' => 'オス',
	'場所' =>	'北雲雀きずきの森',
	'年月' =>	'2021.1',
	'Zoo番号' =>	'8818',
	'ブログ' =>	'2021/01/06/225215',
	'写真' =>	'mozu-m2'
);
$birds[] = array(
	'名前' =>	'ツグミ',	'オスメス' => '',
	'場所' =>	'奥須磨公園',
	'年月' =>	'2021.1',
	'Zoo番号' =>	'6586',
	'ブログ' =>	'2021/01/27/225732',
	'写真' =>	'tsugumi3'
);
$birds[] = array(
	'名前' =>	'ハクセキレイ',	'オスメス' => '',
	'場所' =>	'淡路島公園',
	'年月' =>	'2021.2',
	'Zoo番号' =>	'4718',
	'ブログ' =>	'2021/02/03/231711',
	'写真' =>	'hakusekirei3'
);
$birds[] = array(
	'名前' =>	'キジバト',	'オスメス' => '',
	'場所' =>	'奥須磨公園',
	'年月' =>	'2021.1',
	'Zoo番号' =>	'7316',
	'ブログ' =>	'2021/01/27/225732',
	'写真' =>	'kijibato'
);

$birds[] = array(
	'名前' =>	'アトリ',	'オスメス' => 'オス',
	'場所' =>	'武庫川河川敷',
	'年月' =>	'2021.2',
	'Zoo番号' =>	'8057',
	'ブログ' =>	'2021/02/16/164133',
	'写真' =>	'atori-m'
);
$birds[] = array(
	'名前' =>	'ミヤマホオジロ',	'オスメス' => 'オス',
	'場所' =>	'播磨中央公園',
	'年月' =>	'2021.2',
	'Zoo番号' =>	'13270',
	'ブログ' =>	'2021/02/22/234247',
	'写真' =>	'miyamahoojiro-m'
);
$birds[] = array(
	'名前' =>	'ミヤマホオジロ',	'オスメス' => 'メス',
	'場所' =>	'播磨中央公園',
	'年月' =>	'2021.2',
	'Zoo番号' =>	'13270',
	'ブログ' =>	'2021/02/22/234247',
	'写真' =>	'miyamahoojiro-f'
);
$birds[] = array(
	'名前' =>	'ハッカチョウ',	'オスメス' => '',
	'場所' =>	'淀川河川敷',
	'年月' =>	'2020.2',
	'Zoo番号' =>	'11447',
	'ブログ' =>	'2020/02/07/161922',
	'写真' =>	'hakkachou'
);
$birds[] = array(
	'名前' =>	'ヒバリ',	'オスメス' => 'オス',
	'場所' =>	'加古川河川敷',
	'年月' =>	'2021.4',
	'Zoo番号' =>	'6261',
	'ブログ' =>	'2021/04/09/224227',
	'写真' =>	'hibari'
);
$birds[] = array(
	'名前' =>	'ヒバリ',	'オスメス' => 'メス',
	'場所' =>	'加古川河川敷',
	'年月' =>	'2021.4',
	'Zoo番号' =>	'6261',
	'ブログ' =>	'2021/04/09/224227',
	'写真' =>	'hibari-f'
);
$birds[] = array(
	'名前' =>	'セッカ',	'オスメス' => '',
	'場所' =>	'加古川河川敷',
	'年月' =>	'2021.4',
	'Zoo番号' =>	'3625',
	'ブログ' =>	'2021/04/09/224227',
	'写真' =>	'sekka'
);
$birds[] = array(
	'名前' =>	'ケリ',	'オスメス' => '',
	'場所' =>	'鹿島・扇平自然公園',
	'年月' =>	'2021.4',
	'Zoo番号' =>	'5583',
	'ブログ' =>	'2021/04/07/222414',
	'写真' =>	'keri'
);
$birds[] = array(
	'名前' =>	'ツバメ',	'オスメス' => '',
	'場所' =>	'鹿島・扇平自然公園',
	'年月' =>	'2021.4',
	'Zoo番号' =>	'12802',
	'ブログ' =>	'2021/04/07/222414',
	'写真' =>	'tsubame'
);
$birds[] = array(
	'名前' =>	'センダイムシクイ',	'オスメス' => '',
	'場所' =>	'再度公園',
	'年月' =>	'2021.5',
	'Zoo番号' =>	'3629',
	'ブログ' =>	'2021/05/04/171417',
	'写真' =>	'sendaimushikui2'
);
$birds[] = array(
	'名前' =>	'オオルリ',	'オスメス' => '',
	'場所' =>	'再度公園',
	'年月' =>	'2022.4',
	'Zoo番号' =>	'1690',
	'ブログ' =>	'2022/04/23/213510',
	'写真' =>	'ooruri2'
);
/*
$birds[] = array(
	'名前' =>	'コサメビタキ',	'オスメス' => '',
	'場所' =>	'神戸森林植物園',
	'年月' =>	'2021.4',
	'Zoo番号' =>	'4368',
	'ブログ' =>	'2021/04/15/215646',
	'写真' =>	'kosamebitaki'
);
*/
$birds[] = array(
	'名前' =>	'コサメビタキ',	'オスメス' => '',
	'場所' =>	'尼崎農業公園',
	'年月' =>	'2021.5',
	'Zoo番号' =>	'4368',
	'ブログ' =>	'2021/05/13/171157',
	'写真' =>	'kosamebitaki2'
);
$birds[] = array(
	'名前' =>	'ビンズイ',	'オスメス' => '',
	'場所' =>	'あいな里山公園',
	'年月' =>	'2021.4',
	'Zoo番号' =>	'5910',
	'ブログ' =>	'2021/04/27/222623',
	'写真' =>	'binzui'
);
$birds[] = array(
	'名前' =>	'ニュウナイスズメ',	'オスメス' => '',
	'場所' =>	'奥須磨公園',
	'年月' =>	'2021.4',
	'Zoo番号' =>	'6096',
	'ブログ' =>	'2021/04/22/154931',
	'写真' =>	'nyunaisuzume'
);
$birds[] = array(
	'名前' =>	'オオヨシキリ',	'オスメス' => '',
	'場所' =>	'道場駅近くの武庫川沿い',
	'年月' =>	'2021.5',
	'Zoo番号' =>	'6551',
	'ブログ' =>	'2021/05/06/224233',
	'写真' =>	'ooyoshikiri2'
);
$birds[] = array(
	'名前' =>	'イスカ',	'オスメス' => '',
	'場所' =>	'神戸森林植物園',
	'年月' =>	'2021.5',
	'Zoo番号' =>	'8942',
	'ブログ' =>	'2021/05/25/173917',
	'写真' =>	'isuka'
);
$birds[] = array(
	'名前' =>	'ヤブサメ',	'オスメス' => '',
	'場所' =>	'神戸森林植物園',
	'年月' =>	'2021.9',
	'Zoo番号' =>	'7058',
	'ブログ' =>	'2021/09/13/223556',
	'写真' =>	'yabusame'
);
$birds[] = array(
	'名前' =>	'コムクドリ',	'オスメス' => '',
	'場所' =>	'加古大池、水辺の里公園',
	'年月' =>	'2021.5',
	'Zoo番号' =>	'7104',
	'ブログ' =>	'2021/05/10/182600',
	'写真' =>	'komukudori'
);
$birds[] = array(
	'名前' =>	'イカル',	'オスメス' => '',
	'場所' =>	'京都府立植物園',
	'年月' =>	'2021.12',
	'Zoo番号' =>	'5913',
	'ブログ' =>	'2021/12/02/215448',
	'写真' =>	'ikaru'
);
$birds[] = array(
	'名前' =>	'ベニマシコ',	'オスメス' => '',
	'場所' =>	'猪名川河川敷',
	'年月' =>	'2022.1',
	'Zoo番号' =>	'6719',
	'ブログ' =>	'2022/01/25/194359',
	'写真' =>	'benimashiko'
);
$birds[] = array(
	'名前' =>	'オオジュリン（冬羽）',	'オスメス' => '',
	'場所' =>	'猪名川河川敷',
	'年月' =>	'2022.1',
	'Zoo番号' =>	'4688',
	'ブログ' =>	'2022/01/25/194359',
	'写真' =>	'oojurin'
);
$birds[] = array(
	'名前' =>	'タヒバリ',	'オスメス' => '',
	'場所' =>	'猪名川河川敷',
	'年月' =>	'2022.1',
	'Zoo番号' =>	'7109',
	'ブログ' =>	'2022/01/25/194359',
	'写真' =>	'tahibari'
);
$birds[] = array(
	'名前' =>	'ミソサザイ',	'オスメス' => '',
	'場所' =>	'再度公園',
	'年月' =>	'2022.2',
	'Zoo番号' =>	'5322',
	'ブログ' =>	'2022/02/21/213013',
	'写真' =>	'misosazai'
);
$birds[] = array(
	'名前' =>	'アオゲラ',	'オスメス' => '',
	'場所' =>	'長浜市豊公園',
	'年月' =>	'2022.10',
	'Zoo番号' =>	'5942',
	'ブログ' =>	'2022/10/26/232944',
	'写真' =>	'aogera2'
);
$birds[] = array(
	'名前' =>	'イワツバメ',	'オスメス' => '',
	'場所' =>	'石川河川敷',
	'年月' =>	'2022.3',
	'Zoo番号' =>	'691',
	'ブログ' =>	'2022/03/15/163630',
	'写真' =>	'iwatsubame'
);
$birds[] = array(
	'名前' =>	'キジ',	'オスメス' => '',
	'場所' =>	'雌岡山',
	'年月' =>	'2022.3',
	'Zoo番号' =>	'12885',
	'ブログ' =>	'2022/03/17/171124',
	'写真' =>	'kiji'
);
$birds[] = array(
	'名前' =>	'コマドリ',	'オスメス' => '',
	'場所' =>	'尼崎農業公園',
	'年月' =>	'2022.4',
	'Zoo番号' =>	'8502',
	'ブログ' =>	'2022/04/13/142134',
	'写真' =>	'komadori'
);
$birds[] = array(
	'名前' =>	'ウスユキバト',	'オスメス' => '',
	'場所' =>	'大泉緑地',
	'年月' =>	'2022.4',
	'Zoo番号' =>	'15638',
	'ブログ' =>	'2022/04/07/163111',
	'写真' =>	'usuyukibato'
);
$birds[] = array(
	'名前' =>	'アカハラ',	'オスメス' => '',
	'場所' =>	'日岡山公園',
	'年月' =>	'2022.4',
	'Zoo番号' =>	'5161',
	'ブログ' =>	'2022/04/20/220852',
	'写真' =>	'akahara2'
);
$birds[] = array(
	'名前' =>	'マミジロ',	'オスメス' => '',
	'場所' =>	'大阪城公園',
	'年月' =>	'2022.5',
	'Zoo番号' =>	'1926',
	'ブログ' =>	'2022/05/10/142732',
	'写真' =>	'mamijiro'
);
$birds[] = array(
	'名前' =>	'サンショウクイ',	'オスメス' => '',
	'場所' =>	'神戸森林植物園',
	'年月' =>	'2022.5',
	'Zoo番号' =>	'4351',
	'ブログ' =>	'2022/05/22/144634',
	'写真' =>	'sanshoukui'
);


$birds[] = array(
	'名前' =>	'ムギマキ',	'オスメス' => 'オス',
	'場所' =>	'あいな里山公園',
	'年月' =>	'2022.10',
	'Zoo番号' =>	'6879',
	'ブログ' =>	'2022/10/29/170944',
	'写真' =>	'mugimaki'
);
$birds[] = array(
	'名前' =>	'ノゴマ',	'オスメス' => '',
	'場所' =>	'大阪城公園',
	'年月' =>	'2022.10',
	'Zoo番号' =>	'4369',
	'ブログ' =>	'2022/10/18/145156',
	'写真' =>	'nogoma2'
);
$birds[] = array(
	'名前' =>	'エゾビタキ',	'オスメス' => '',
	'場所' =>	'甲山森林公園',
	'年月' =>	'2022.10.',
	'Zoo番号' =>	'6885',
	'ブログ' =>	'2022/10/12/175712',
	'写真' =>	'ezobitaki'
);
$birds[] = array(
	'名前' =>	'モズ',	'オスメス' => '白い',
	'場所' =>	'松陰新田ため池',
	'年月' =>	'2022.10.',
	'Zoo番号' =>	'8818',
	'ブログ' =>	'2022/10/01/214935',
	'写真' =>	'shiromozu'
);
$birds[] = array(
	'名前' =>	'マミチャジナイ',	'オスメス' => '',
	'場所' =>	'大阪城公園',
	'年月' =>	'2022.11',
	'Zoo番号' =>	'4367',
	'ブログ' =>	'2022/11/04/153520',
	'写真' =>	'kurotsugumi-f'
);

$birds[] = array(
	'名前' =>	'ハギマシコ',	'オスメス' => '',
	'場所' =>	'六甲山',
	'年月' =>	'2022.11',
	'Zoo番号' =>	'8734',
	'ブログ' =>	'2022/11/19/192556',
	'写真' =>	'hagimashiko'
);
$birds[] = array(
	'名前' =>	'クロジ',	'オスメス' => '',
	'場所' =>	'六甲山',
	'年月' =>	'2022.11',
	'Zoo番号' =>	'7331',
	'ブログ' =>	'2022/11/19/192556',
	'写真' =>	'kuroji'
);
/*

$birds[] = array(
	'名前' =>	'',	'オスメス' => '',
	'場所' =>	'',
	'年月' =>	'',
	'Zoo番号' =>	'',
	'ブログ' =>	'',
	'写真' =>	''
);
$birds[] = array(
	'名前' =>	'',	'オスメス' => '',
	'場所' =>	'',
	'年月' =>	'',
	'Zoo番号' =>	'',
	'ブログ' =>	'',
	'写真' =>	''
);
*/

//asort($birds);	// 並び替え：値でのソート。これだと、'別名'ありのデータが最後になってしまう。
/* ----- 並び替え ----- */
foreach ((array) $birds as $key => $value) {
	$sort[$key] = $value['名前'];
}
array_multisort($sort, SORT_ASC, $birds);	// 多次元連想配列のソート
/* ----- 並び替え ----- */
$bireds_shu = 0;
$bireds_old = '';
$bireds = 0;
$cnt = 0;
$page = 1;
foreach	($birds as $bird){
	$bireds++;
	if ($bird['名前'] != $bireds_old) {
		$bireds_shu++;
	}
	$bireds_old = $bird['名前'];
	if (++$cnt == 21) {
		$page++;
?>
	<!-- ********* 20個単位 改頁 page:<?= $page ?> ********* -->
<h3 class="break"></h3>
<p class="page-top">.....</p>
<?php
		$cnt = 1;
	}
?>
<div class="box-frame"><div class="in-box"><p class="name"><?= $bird['名前'] ?>
<?php
	if (isset($bird['別名'])) {
?>
	| <span style="font-size:12px;"><?= $bird['別名'] ?></span>
<?php
	}
	if ($bird['オスメス'] <> '') {
?><span style="font-size:12px;">(<?= $bird['オスメス'] ?>)</span>
<?php
	}
?><a class="search1" target="_blank" href="https://zoopicker.com/animals/<?= $bird['Zoo番号'] ?>">Zoo</a>
	<a class="search2" target="_blank" href="https://www.google.com/search?tbm=isch&q=野鳥+<?= $bird['名前'] ?>+<?= $bird['オスメス'] ?>">画像</a>
	<a class="search2" target="_blank" href="https://www.youtube.com/results?search_query=野鳥+<?= $bird['名前'] ?>+<?= $bird['オスメス'] ?>">動画</a>
	<a class="search2" target="_blank" href="https://2ndart.hatenablog.com/entry/<?= $bird['ブログ'] ?>">Blog</a></p>
	<img class="popup" src="photo/320/<?= $bird['写真'] ?>.jpg">
	<p class="place"><?= $bird['場所'] ?>　<?= $bird['年月'] ?></p>
</div></div>
<?php
}
?>
	</div>
</div>
<div id="footer">
<p id="goukei">【<?= $bireds_shu ?> 種類】【オス・メス別 <?= $bireds ?> 種類】</p>
<div style="clear:both;padding:10px 0 0 0;text-align:center;">
<h3><a href="mizudori.php">→→→ 水鳥・猛禽類</a></h3>
<a href="https://2ndart.hatenablog.com/archive" target="_blank">≪晴歩雨描≫</a>
<a href="https://2ndart.hatenablog.com/archive/category/野鳥" target="_blank" style="margin-left:6px;">ブログ：野鳥</a>
</div>
</div>
<div id="modal-container">
	<div><img src=""></div>
</div>
<script>
const modal = $('#modal-container');
const img = modal.find('img');
$('img.popup').each(function(index) {
	$(this).click(function() {
		img.attr('src', $(this).attr('src').replace('320', '800'));
		modal.show();
	})
});
modal.click(function() {
	$(this).hide();
});
</script>
</body>
</html>
